In [79]:
import pandas as pd
import numpy as np
from sklearn import preprocessing

# Data Set information

This data set contains 416 liver patient records and 167 non liver patient records.The data set was collected from north east of Andhra Pradesh, India. Selector is a class label used to divide into groups(liver patient or not). This data set contains 441 male patient records and 142 female patient records.

Any patient whose age exceeded 89 is listed as being of age "90".

## Attributes
1. Age - Age of the patient
2. Gender - Gender of the patient
3. TB - Total Bilirubin
4. DB - Direct Bilirubin
5. Alkphos - Alkaline Phosphotase
6. Sgpt - Alamine Aminotransferase
7. Sgot - Aspartate Aminotransferase
8. TP - Total Protiens
9. ALB - Albumin
10. A/G Ratio - Albumin and Globulin Ratio
11. Selector field used to split the data into two sets (labeled by the experts)

# Read the data

In [80]:
# dataset location
dataset_location = "./dataset/ilpd_dataset.csv"

# column names
names = ['age', 'gender', 'tb', 'db', 'alkphos', 'sgpt', 'sgot', 'tp', 'alb', 'ag_ratio', 'selector']

# read dataset to pandas dataframe
df = pd.read_csv(dataset_location, names=names);

# show first five cols of the dataset
print("Data shape: ", df.shape)
df.head()

Data shape:  (583, 11)

   age  gender    tb   db  alkphos  sgpt  sgot   tp  alb  ag_ratio  selector
0   65  Female   0.7  0.1      187    16    18  6.8  3.3      0.90         1
1   62    Male  10.9  5.5      699    64   100  7.5  3.2      0.74         1
2   62    Male   7.3  4.1      490    60    68  7.0  3.3      0.89         1
3   58    Male   1.0  0.4      182    14    20  6.8  3.4      1.00         1
4   72    Male   3.9  2.0      195    27    59  7.3  2.4      0.40         1

# Preprocessing

## change non-numerical values to integers

In [81]:
# check unique values
df['gender'].unique()

array(['Female', 'Male'], dtype=object)

In [82]:
# change unique category names to integers
gender_dict = {"Female": 0, "Male": 1}
df['gender'] = df['gender'].map(gender_dict)

df.head()

   age  gender    tb   db  alkphos  sgpt  sgot   tp  alb  ag_ratio  selector
0   65       0   0.7  0.1      187    16    18  6.8  3.3      0.90         1
1   62       1  10.9  5.5      699    64   100  7.5  3.2      0.74         1
2   62       1   7.3  4.1      490    60    68  7.0  3.3      0.89         1
3   58       1   1.0  0.4      182    14    20  6.8  3.4      1.00         1
4   72       1   3.9  2.0      195    27    59  7.3  2.4      0.40         1

## separate dataset attributes (X) from Class (y)

In [86]:
# separate the first 10 cols (X) from 11th col (y)
X = df.iloc[:, 0:10]
y = df.iloc[:, 10]

# show first five cols of X
X.head()

   age  gender    tb   db  alkphos  sgpt  sgot   tp  alb  ag_ratio
0   65       0   0.7  0.1      187    16    18  6.8  3.3      0.90
1   62       1  10.9  5.5      699    64   100  7.5  3.2      0.74
2   62       1   7.3  4.1      490    60    68  7.0  3.3      0.89
3   58       1   1.0  0.4      182    14    20  6.8  3.4      1.00
4   72       1   3.9  2.0      195    27    59  7.3  2.4      0.40

In [88]:
# show unique class categories (of y)
y.unique()

array([1, 2])

##awd

In [70]:
# change unique category names to integers
gender_dict = {"Female": 0, "Male": 1}